app/controllers/competitions_controller.rb

  def index
    @competitions = Competition.all
---
SELECT "competitions".* FROM "competitions"