app/controllers/competitors_controller.rb

  def index
    @competitors = Competitor.all
---
SELECT "competitors".* FROM "competitors"