app/controllers/sessions_controller.rb

  def create
    mail = params[:session][:email]
    pass = params[:session][:password]
    puts '-----> LLego el email1 '+mail
    puts '-----> LLego el pass1 '+pass
    user = User.where(:email => mail.to_s).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "ra.gomez11@uniandes.edu.co"]]